ehcouto/DEA801_ARMotion/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: MCXA166
package_id: MCXA166VLH
mcu_data: ksdk2_0
processor_version: 0.2412.20
external_user_signals:
  properties: [I/O Supply, Default, ISP, ANALOG, ALT0, ALT1, ALT2, ALT3, ALT4, ALT5, ALT6, ALT7, ALT8, ALT9, ALT10, ALT11, ALT12, VDD, Pad type, 'Motor Control Function ',
    Remark, Checked, NXP Comments]
  routingDetailsColumns: ['', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', Peripheral, Signal, Routed pin/signal, Direction]
  signals:
  - id: P1_8
    pin_connections: ['2']
    property_values: [VDD, DIS, I2C_SDA, '', P1_8, FREQME_CLK_IN0, LPUART1_RXD, LPI2C2_SDA, CT_INP8, CT0_MAT2, '', SmartDMA_PIO4, '', '', '', '', '', WUU0_IN10, HD+I3C,
      UART1_RXD, For main board comm., 'Yes', '']
  - id: P1_9
    pin_connections: ['3']
    property_values: [VDD, DIS, I2C_SCL, '', P1_9, FREQME_CLK_IN1, LPUART1_TXD, LPI2C2_SCL, CT_INP9, CT0_MAT3, '', SmartDMA_PIO5, '', '', '', '', '', '', HD, UART1_TXD,
      For main board comm., 'Yes', '']
  - id: P1_10
    pin_connections: ['4']
    property_values: [VDD, DIS, '', ADC1_A8, P1_10, '', LPUART1_RTS_B, LPI2C2_SDAS, CT2_MAT0, '', '', SmartDMA_PIO6, LPUART5_TXD, '', '', CAN0_TXD, '', '', SLOW,
      '', '', 'Yes', Rerouted GP_OUT_1 (24 -: 4)]
  - id: P1_11
    pin_connections: ['5']
    property_values: [VDD, DIS, '', ADC1_A9, P1_11, TRIG_OUT2, LPUART1_CTS_B, LPI2C2_SCLS, CT2_MAT1, '', '', SmartDMA_PIO7, LPUART5_RXD, '', '', CAN0_RXD, '', WUU0_IN11,
      SLOW, '', '', 'Yes', Rerouted GP_OUT_2 (26 -: 5)]
  - id: P1_12
    pin_connections: ['6']
    property_values: [VDD, DIS, '', ADC1_A10, P1_12, '', LPI2C1_SDA, LPUART2_RXD, CT2_MAT2, '', '', SmartDMA_PIO8, LPUART5_CTS_B, '', '', '', '', WUU0_IN12, SLOW,
      GP_OUT_3, test output (GPIO/OUT), 'Yes', '']
  - id: P1_13
    pin_connections: ['7']
    property_values: [VDD, DIS, '', ADC1_A11, P1_13, TRIG_IN3, LPI2C1_SCL, LPUART2_TXD, CT2_MAT3, '', '', SmartDMA_PIO9, LPUART5_RTS_B, '', '', '', '', '', SLOW,
      ADC1_A11_AC, AC line voltage sampling(ADC), 'Yes', '']
  - id: P1_29
    pin_connections: ['8']
    property_values: [VDD, ALT1, '', '', P1_29, RESET_B, SPC_LPREQ, '', '', '', '', '', '', '', '', '', '', RESET_B, RST, MCU RESET, MCU RESET, 'Yes', '']
  - id: P1_30
    pin_connections: ['9']
    property_values: [VDD, DIS, '', XTAL48M, P1_30, TRIG_OUT3, '', LPI2C0_SDA, CT_INP16, '', '', '', '', '', '', '', '', '', HD+I3C, XTAL_1, opt. xtal input, 'Yes',
      XTAL]
  - id: P1_31
    pin_connections: ['10']
    property_values: [VDD, DIS, '', EXTAL48M, P1_31, TRIG_IN4, '', LPI2C0_SCL, CT_INP17, '', '', '', '', '', '', '', '', '', HD, XTAL_2, opt. xtal input, 'Yes', EXTAL]
  - id: VSS
    pin_connections: ['11']
    property_values: [VDD, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', 'Yes', '']
  - id: VDD_ANA
    pin_connections: ['12']
    property_values: [VDD, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', 'Yes', '']
  - id: VDD
    pin_connections: ['13']
    property_values: [VDD, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', 'Yes', '']
  - id: P2_0
    pin_connections: ['14']
    property_values: [VDD, DIS, '', ADC0_A0/OPAMP2_INP, P2_0, TRIG_IN6, LPUART0_RXD, LPUART4_CTS_B, CT_INP16, CT2_MAT0, '', SmartDMA_PIO24, '', '', '', '', '', WUU0_IN18,
      SLOW, P2_0_DRUM_UP, test output (GPIO/OUT), 'Yes', OPMAP2_INP_CURR_W]
  - id: P2_1
    pin_connections: ['15']
    property_values: [VDD, DIS, '', ADC1_A0/OPAMP2_INN, P2_1, TRIG_IN7, LPUART0_TXD, LPUART4_RTS_B, CT_INP17, CT2_MAT1, '', SmartDMA_PIO25, '', '', '', '', '', '',
      SLOW, ADC1_A0_CURR_W, Current ADC for W(ADC), 'Yes', OPMAP2_INN_CURR_W]
  - id: P2_2
    pin_connections: ['16']
    property_values: [VDD, DIS, UART_TXD, ADC0_A4/CMP0_IN0/DAC0_OUT/CMP1_INN4/CMP2_INN4, P2_2, TRIG_IN6, LPUART0_RTS_B, LPUART2_TXD, CT_INP12, CT2_MAT2, '', SmartDMA_PIO26,
      '', '', '', '', '', '', SLOW, GP_OUT_4, test output  (GPIO/OUT), 'Yes', '']
  - id: P2_3
    pin_connections: ['17']
    property_values: [VDD, DIS, UART_RXD, ADC0_A3/CMP1_IN0/ADC1_A4, P2_3, TRIG_IN7, LPUART0_CTS_B, LPUART2_RXD, CT_INP13, CT2_MAT3, '', SmartDMA_PIO27, '', '', '',
      '', '', WUU0_IN19, SLOW, '', '', 'Yes', Rerouted OVER_CURRENT_TRIP_INP (39 -: 17)]
  - id: P2_4
    pin_connections: ['18']
    property_values: [VDD, DIS, '', ADC0_A1/ADC2_A0/CMP2_IN0, P2_4, '', '', LPUART2_CTS_B, CT_INP14, CT1_MAT0, '', SmartDMA_PIO28, '', '', '', '', '', '', SLOW, '',
      '', 'Yes', Not used]
  - id: P2_5
    pin_connections: ['19']
    property_values: [VDD, DIS, '', ADC1_A1/ADC3_A0, P2_5, '', '', LPUART2_RTS_B, CT_INP15, CT1_MAT1, '', SmartDMA_PIO29, '', '', '', '', '', '', SLOW, '', '', 'Yes',
      Rerouted ADC0_A6_MCU_ANALOG_TEST (25 -: 19)]
  - id: P2_6
    pin_connections: ['20']
    property_values: [VDD, DIS, '', ADC1_A3/ADC2_A2/OPAMP2_OUT/CMP2_INP4, P2_6, TRIG_OUT4, LPSPI1_PCS1, LPUART4_RXD, CT_INP18, CT1_MAT2, '', SmartDMA_PIO30, '', '',
      '', '', '', '', SLOW, '', '', 'Yes', OPMAP2_OUT_CURR_W (ADC1_A3 / ADC2_A2 / CMP2_INP4)]
  - id: P2_7
    pin_connections: ['21']
    property_values: [VDD, DIS, '', VREFI/ADC0_A7/ADC1_A7/ADC2_A7/ADC3_A7, P2_7, TRIG_IN5, '', LPUART4_TXD, CT_INP19, CT1_MAT3, '', SmartDMA_PIO31, '', '', '', '',
      '', '', SLOW, VREF, 'ADC Vef Inp??', 'Yes', '']
  - id: P2_12
    pin_connections: ['22']
    property_values: [VDD, DIS, '', ADC0_A5/ADC2_A5/OPAMP0_INP, P2_12, '', LPSPI1_SCK, LPUART1_RXD, CT4_MAT0, CT0_MAT0, '', SmartDMA_PIO16, '', '', '', CAN0_RXD,
      '', WUU0_IN20, SLOW, GP_OUT_0, test output  (GPIO/OUT), 'Yes', OPMAP0_INP_CURR_U]
  - id: P2_13
    pin_connections: ['23']
    property_values: [VDD, DIS, '', ADC1_A5/ADC3_A5/OPAMP0_INN, P2_13, TRIG_IN8, LPSPI1_SDO, LPUART1_TXD, CT4_MAT1, CT0_MAT1, '', SmartDMA_PIO17, '', '', '', CAN0_TXD,
      '', '', SLOW, ADC1_A5_CURR_V, Current ADC for V(ADC), 'Yes', OPAMP0_INN_CURR_U]
  - id: P2_15
    pin_connections: ['24']
    property_values: [VDD, DIS, '', OPAMP0_OUT/ADC0_A2/CMP0_INP4, P2_15, TRIG_OUT4, LPSPI1_SDI, LPUART1_RTS_B, CT4_MAT3, CT0_MAT2, '', SmartDMA_PIO18, '', '', '',
      '', '', WUU0_IN21, SLOW, GP_OUT_1, test output  (GPIO/OUT), 'Yes', OPAMP0_OUT_CURR_U (ADC0_A2 / CMP0_IN4)]
  - id: P2_16
    pin_connections: ['25']
    property_values: [VDD, DIS, '', ADC0_A6/ADC2_A4/OPAMP1_INP, P2_16, '', LPSPI1_SDI, LPUART1_RTS_B, CT3_MAT0, CT0_MAT2, '', SmartDMA_PIO19, '', '', '', '', '',
      '', SLOW, ADC0_A6_MCU_ANALOG_TEST, MCU analog test ADC inp (ADC), 'Yes', OPMAP1_INP_CURR_V]
  - id: P2_17
    pin_connections: ['26']
    property_values: [VDD, DIS, '', ADC1_A6/ADC3_A4/OPAMP1_INN, P2_17, TRIG_IN9, LPSPI1_PCS0, LPUART1_CTS_B, CT3_MAT1, CT0_MAT3, '', SmartDMA_PIO20, '', '', '', '',
      '', '', SLOW, GP_OUT_2, test output  (GPIO/OUT), 'Yes', OPMAP1_INN_CURR_V]
  - id: P2_19
    pin_connections: ['27']
    property_values: [VDD, DIS, '', ADC1_A2/OPAMP1_OUT/CMP1_INP4, P2_19, TRIG_OUT5, '', '', CT3_MAT3, '', '', SmartDMA_PIO21, '', '', '', '', '', '', SLOW, ADC1_A2_CURR_U,
      Current ADC for U (ADC), 'Yes', OPMAP1_OUT_CURR_V (ADC1_A2 / CMP1_IN4)]
  - id: VSS
    pin_connections: ['28']
    property_values: [VDD, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', 'Yes', '']
  - id: VDD
    pin_connections: ['29']
    property_values: [VDD, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', 'Yes', '']
  - id: P3_31
    pin_connections: ['30']
    property_values: [VDD, DIS, '', ADC1_A20, P3_31, TRIG_IN10, LPI2C3_SDAS, LPUART4_CTS_B, CT0_MAT3, '', '', PWM1_B0, '', '', SmartDMA_PIO31, '', '', LPTMR0_ALT2,
      SLOW+TAM, ADC1_A20_IPMTEMP, IPM temp reading ADC(ADC), 'Yes', '']
  - id: P3_30
    pin_connections: ['31']
    property_values: [VDD, DIS, '', ADC1_A21, P3_30, TRIG_OUT6, LPI2C3_SCLS, LPUART4_RTS_B, CT0_MAT2, '', '', PWM1_A0, '', '', SmartDMA_PIO30, '', '', '', SLOW, NTC_BYPASS_RLY,
      NTC bypass relay drive output (GPIO), 'Yes', '']
  - id: P3_29
    pin_connections: ['32']
    property_values: [VDD, ALT1, '', ADC1_A22, P3_29, ISPMODE_N, LPI2C3_HREQ, '', CT_INP3, CT3_MAT3, '', '', '', '', SmartDMA_PIO29, '', '', WUU0_IN27, SLOW+TAM,
      '', '', 'Yes', Not used]
  - id: P3_28
    pin_connections: ['33']
    property_values: [VDD, DIS, '', '', P3_28, TRIG_IN11, LPI2C3_SDA, LPUART4_RXD, CT_INP12, CT3_MAT2, '', PWM1_B3, '', '', SmartDMA_PIO28, '', '', WUU0_IN26, 5VTOL,
      UART4_RXD, General UART, 'Yes', '']
  - id: P3_27
    pin_connections: ['34']
    property_values: [VDD, DIS, '', '', P3_27, TRIG_OUT7, LPI2C3_SCL, LPUART4_TXD, CT_INP13, CT3_MAT1, '', PWM1_A3, '', '', SmartDMA_PIO27, '', '', WUU0_IN30, 5VTOL,
      UART4_TXD, General UART, 'Yes', '']
  - id: P3_15
    pin_connections: ['35']
    property_values: [VDD, DIS, '', ADC3_A17, P3_15, '', LPUART2_TXD, LPUART3_RTS_B, CT_INP7, PWM0_X3, '', PWM1_B1, '', '', SmartDMA_PIO15, '', '', '', SLOW, '',
      '', 'Yes', Not used]
  - id: P3_14
    pin_connections: ['36']
    property_values: [VDD, DIS, '', ADC3_A16, P3_14, '', LPUART2_RXD, LPUART3_CTS_B, CT_INP6, PWM0_X2, '', PWM1_A1, '', '', SmartDMA_PIO14, '', '', WUU0_IN25, SLOW,
      GP_INP_0, test input  (GPIO/INPUT), 'Yes', '']
  - id: P3_13
    pin_connections: ['37']
    property_values: [VDD, DIS, '', ADC3_A15, P3_13, '', LPUART2_CTS_B, LPUART3_RXD, CT1_MAT3, PWM0_X1, '', PWM1_B2, '', '', SmartDMA_PIO13, '', '', '', SLOW, GP_INP_1,
      test input  (GPIO/INPUT), 'Yes', '']
  - id: P3_12
    pin_connections: ['38']
    property_values: [VDD, DIS, '', ADC3_A14, P3_12, '', LPUART2_RTS_B, LPUART3_TXD, CT1_MAT2, PWM0_X0, '', PWM1_A2, '', '', SmartDMA_PIO12, '', '', '', SLOW, GP_INP_2,
      test input  (GPIO/INPUT), 'Yes', '']
  - id: P3_11
    pin_connections: ['39']
    property_values: [VDD, DIS, '', '', P3_11, TRIG_IN6, LPSPI1_PCS0, LPUART1_CTS_B, CT1_MAT1, PWM0_B2, '', '', LPUART5_RXD, '', SmartDMA_PIO11, '', '', WUU0_IN24,
      MED, OVER_CURRENT_TRIP_INP, over current trip input fast, 'Yes', Rerouted PWM_W_L (41 -: 39)]
  - id: P3_10
    pin_connections: ['40']
    property_values: [VDD, DIS, '', '', P3_10, TRIG_IN5, LPSPI1_SCK, LPUART1_RTS_B, CT1_MAT0, PWM0_A2, '', '', LPUART5_TXD, '', SmartDMA_PIO10, '', '', '', MED, OVER_VOLTAGE_TRIP_INP,
      over voltage trip input fast, 'Yes', Rerouted PWM_W_H (42 -: 40)]
  - id: P3_9
    pin_connections: ['41']
    property_values: [VDD, DIS, '', '', P3_9, TRIG_IN4, LPSPI1_SDI, LPUART1_TXD, CT_INP5, PWM0_B1, '', '', LPUART5_RTS_B, '', SmartDMA_PIO9, '', '', '', MED, PWM_W_L,
      'to IPM, W phase, low side driver (active high)', 'Yes', Rerouted to PWM_V_L (43 -: 41)]
  - id: P3_8
    pin_connections: ['42']
    property_values: [VDD, DIS, '', '', P3_8, TRIG_IN3, LPSPI1_SDO, LPUART1_RXD, CT_INP4, PWM0_A1, '', '', LPUART5_CTS_B, '', SmartDMA_PIO8, '', CLKOUT, WUU0_IN23,
      MED, PWM_W_H, 'to IPM, W phase, high side driver (active high)', 'Yes', Rerouted to PWM_V_H (44 -: 42)]
  - id: P3_7
    pin_connections: ['43']
    property_values: [VDD, DIS, '', ADC3_A13, P3_7, TRIG_IN2, LPSPI1_PCS2, LPUART3_CTS_B, CT4_MAT3, PWM0_B3, '', PWM1_B0, '', '', SmartDMA_PIO7, '', '', '', MED,
      PWM_V_L, 'to IPM, V phase, low side driver (active high)', 'Yes', Not used]
  - id: P3_6
    pin_connections: ['44']
    property_values: [VDD, DIS, '', ADC3_A12, P3_6, CLKOUT, LPSPI1_PCS3, LPUART3_RTS_B, CT4_MAT2, PWM0_A3, '', PWM1_A0, '', '', SmartDMA_PIO6, '', FREQME_CLK_OUT1,
      '', MED, PMW_V_H, 'to IPM, V phase, high side driver (active high)', 'Yes', Not used]
  - id: P3_1
    pin_connections: ['45']
    property_values: [VDD, DIS, '', '', P3_1, TRIG_IN1, '', LPUART3_TXD, CT_INP17, PWM0_B0, '', PWM1_X1, '', '', SmartDMA_PIO1, '', FREQME_CLK_OUT0, '', HD, PMW_U_L,
      'to IPM, U phase, low side driver (active high)', 'Yes', '']
  - id: P3_0
    pin_connections: ['46']
    property_values: [VDD, DIS, '', '', P3_0, TRIG_IN0, '', LPUART3_RXD, CT_INP16, PWM0_A0, '', PWM1_X0, '', '', SmartDMA_PIO0, '', '', WUU0_IN22, HD, PMW_U_H, 'to
        IPM,U phase, high side driver (active high)', 'Yes', '']
  - id: VSS
    pin_connections: ['47']
    property_values: [VDD, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', 'Yes', '']
  - id: VDD
    pin_connections: ['48']
    property_values: [VDD, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', 'Yes', '']
  - id: P0_0
    pin_connections: ['49']
    property_values: [VDD, ALT1, '', '', P0_0, TMS/SWDIO, LPUART0_RTS_B, LPSPI0_PCS0, CT_INP0, '', '', '', '', '', '', '', '', '', SLOW, SWDIO, debug/programming,
      'Yes', '']
  - id: P0_1
    pin_connections: ['50']
    property_values: [VDD, ALT1, '', '', P0_1, TCLK/SWCLK, LPUART0_CTS_B, LPSPI0_SDI, CT_INP1, '', '', '', '', '', '', '', '', '', SLOW, SWCLK, debug/programming,
      'Yes', '']
  - id: P0_2
    pin_connections: ['51']
    property_values: [VDD, ALT1, '', ADC2_A8, P0_2, TDO/SWO, LPUART0_RXD, LPSPI0_SCK, CT0_MAT0, UTICK_CAP0, '', '', '', '', '', '', '', '', SLOW, SWO, debug/programming,
      'Yes', '']
  - id: P0_3
    pin_connections: ['52']
    property_values: [VDD, ALT1, '', CMP1_IN1/ADC0_A14, P0_3, TDI, LPUART0_TXD, LPSPI0_SDO, CT0_MAT1, UTICK_CAP1, '', '', CMP0_OUT, '', '', '', '', '', SLOW, '',
      '', 'Yes', Not used]
  - id: P0_6
    pin_connections: ['53']
    property_values: [VDD, ALT1, ISPMODE_N, ADC0_A15, P0_6, ISPMODE_N, LPI2C0_HREQ, LPSPI0_PCS1, CT_INP2, '', '', SmartDMA_PIO2, CMP1_OUT, '', '', '', CLKOUT, '',
      SLOW, '??', '??', 'Yes', Not used]
  - id: P0_16
    pin_connections: ['54']
    property_values: [VDD, DIS, '', '', P0_16, '', LPI2C0_SDA, LPSPI0_PCS2, CT0_MAT0, UTICK_CAP2, '', SmartDMA_PIO6, '', '', '', '', '', WUU0_IN2, HD+I3C, '', '',
      'Yes', Rerouted P2_0_DRUM_UP (14 -: 54)]
  - id: P0_17
    pin_connections: ['55']
    property_values: [VDD, DIS, '', '', P0_17, '', LPI2C0_SCL, LPSPI0_PCS3, CT0_MAT1, UTICK_CAP3, '', SmartDMA_PIO7, '', '', '', '', '', '', HD, '', '', 'Yes', Rerouted
        GP_OUT_0 (22 -: 55)]
  - id: P1_0
    pin_connections: ['56']
    property_values: [VDD, DIS, SPI_SDO, ADC0_A16/CMP0_IN3, P1_0, TRIG_IN0, LPSPI0_SDO, LPI2C1_SDA, CT_INP4, CT0_MAT2, '', '', '', '', '', '', '', WUU0_IN6/LPTMR0_ALT3,
      MED+I2C, '', '', 'Yes', Rerouted OVER_VOLTAGE_TRIP_INP (40 -: 56)]
  - id: P1_1
    pin_connections: ['57']
    property_values: [VDD, DIS, SPI_SCK, ADC0_A17/CMP1_IN3, P1_1, TRIG_IN1, LPSPI0_SCK, LPI2C1_SCL, CT_INP5, CT0_MAT3, '', '', '', '', '', '', '', '', MED+I2C, GP_OUT_5,
      test output  (GPIO/OUT), 'Yes', '']
  - id: P1_2
    pin_connections: ['58']
    property_values: [VDD, DIS, SPI_SDI, ADC0_A18/CMP2_IN3, P1_2, TRIG_OUT0, LPSPI0_SDI, LPI2C1_SDAS, CT1_MAT0, CT_INP0, '', '', '', '', '', CAN0_TXD, '', '', MED,
      ADC0_A18_VBUS_DC_2, DC BUS voltage input-2 (ADC), 'Yes', '']
  - id: P1_3
    pin_connections: ['59']
    property_values: [VDD, DIS, SPI_PCS, ADC0_A19/CMP0_IN1, P1_3, TRIG_OUT1, LPSPI0_PCS0, LPI2C1_SCLS, CT1_MAT1, CT_INP1, '', '', '', '', '', CAN0_RXD, '', WUU0_IN7,
      MED, ADC0_A19_VBUS_DC_1, DC BUS voltage input-1 (ADC), 'Yes', '']
  - id: VDD
    pin_connections: ['60']
    property_values: [VDD, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', 'Yes', '']
  - id: VSS
    pin_connections: ['61']
    property_values: [VDD, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', 'Yes', '']
  - id: P1_4
    pin_connections: ['62']
    property_values: [VDD, DIS, '', ADC0_A20/CMP0_IN2, P1_4, FREQME_CLK_IN0, LPSPI0_PCS3, LPUART2_RXD, CT1_MAT2, '', '', SmartDMA_PIO0, '', '', '', '', '', WUU0_IN8,
      MED, ADC0_A20_BEMF_W, Motor W phase voltage  (ADC), 'Yes', BEMF_W]
  - id: P1_5
    pin_connections: ['63']
    property_values: [VDD, DIS, '', ADC0_A21/CMP1_IN2, P1_5, FREQME_CLK_IN1, LPSPI0_PCS2, LPUART2_TXD, CT1_MAT3, '', '', SmartDMA_PIO1, '', '', '', '', '', '', MED,
      ADC0_A21_BEMF_V, Motor V phase voltage  (ADC), 'Yes', BEMF_V]
  - id: P1_6
    pin_connections: ['64']
    property_values: [VDD, DIS, '', ADC0_A22, P1_6, TRIG_IN2, LPSPI0_PCS1, LPUART2_RTS_B, CT_INP6, CT4_MAT0, '', SmartDMA_PIO2, '', '', '', '', '', '', MED, ADC0_A22_BEMF_U,
      Motor U phase voltage  (ADC), 'Yes', BEMF_U]
  - id: P1_7
    pin_connections: ['1']
    property_values: [VDD, DIS, '', ADC0_A23, P1_7, TRIG_OUT2, '', LPUART2_CTS_B, CT_INP7, CT4_MAT1, '', SmartDMA_PIO3, '', '', '', '', '', WUU0_IN9, MED, '', '',
      'Yes', Not used]
pin_labels:
- {pin_num: '6', pin_signal: P1_12/WUU0_IN12/LPI2C1_SDA/LPUART2_RXD/CT2_MAT2/SmartDMA_PIO8/LPUART5_CTS_B/ADC1_A10, label: FB_HEATER, identifier: GP_OUT_3;FB_HEATER}
- {pin_num: '16', pin_signal: P2_2/TRIG_IN6/LPUART0_RTS_B/LPUART2_TXD/CT_INP12/CT2_MAT2/SmartDMA_PIO26/ADC0_A4/CMP0_IN0/DAC0_OUT, label: DAC_OUT, identifier: GP_OUT_4;DAC_OUT;DAC_OUT_CMP0N;DAC_OUT_CMP0P;DAC_OUT_ADC0A4}
- {pin_num: '24', pin_signal: P2_15/WUU0_IN21/TRIG_OUT4/LPSPI1_SDI/LPUART1_RTS_B/CT4_MAT3/CT0_MAT2/SmartDMA_PIO18/OPAMP0_OUT/ADC0_A2, label: OPAMP0_OUT_CURR_U, identifier: GP_OUT_1;CURR_U;OPAMP0_OUT_CURR_U;ADC0_A2_CURR_U}
- {pin_num: '26', pin_signal: P2_17/TRIG_IN9/LPSPI1_PCS0/LPUART1_CTS_B/CT3_MAT1/CT0_MAT3/SmartDMA_PIO20/ADC1_A6/ADC3_A4/OPAMP1_INN, label: OPAMP1_INN_CURR_V, identifier: GP_OUT_2;OPAMP1_OUT_CURR_V;OPAMP1_INN_CURR_V;ADC1_A6_CURR_V;ADC3_A4_CURR_V}
