ehcouto/DEA801_ARMotion/board/pin_mux.c
- {pin_num: '31', pin_signal: P3_30/TRIG_OUT6/LPI2C3_SCLS/LPUART4_RTS_B/CT0_MAT2/PWM1_A0/SmartDMA_PIO30/ADC1_A21, label: PUMP_SET, identifier: NTC_BYPASS_RLY;PUMP_SEP;PUMP_SET}
- {pin_num: '36', pin_signal: P3_14/WUU0_IN25/LPUART2_RXD/LPUART3_CTS_B/CT_INP6/PWM0_X2/PWM1_A1/SmartDMA_PIO14/ADC3_A16, label: PILOT_EV_H2O, identifier: GP_INP_0;PILOT_EV_H2O}
- {pin_num: '37', pin_signal: P3_13/LPUART2_CTS_B/LPUART3_RXD/CT1_MAT3/PWM0_X1/PWM1_B2/SmartDMA_PIO13/ADC3_A15, label: PILOT_EV_DISP, identifier: GP_INP_1;PILOT_EV_DISP}
- {pin_num: '38', pin_signal: P3_12/LPUART2_RTS_B/LPUART3_TXD/CT1_MAT2/PWM0_X0/PWM1_A2/SmartDMA_PIO12/ADC3_A14, label: PILOT_EV_REGEN, identifier: GP_INP_2;PILOT_EV_REGEN}
- {pin_num: '39', pin_signal: P3_11/WUU0_IN24/TRIG_IN6/LPSPI1_PCS0/LPUART1_CTS_B/CT1_MAT1/PWM0_B2/LPUART5_RXD/SmartDMA_PIO11, label: PWM_W_L, identifier: PWM_W_L}
- {pin_num: '40', pin_signal: P3_10/TRIG_IN5/LPSPI1_SCK/LPUART1_RTS_B/CT1_MAT0/PWM0_A2/LPUART5_TXD/SmartDMA_PIO10, label: PWM_W_H, identifier: PWM_W_H}
- {pin_num: '41', pin_signal: P3_9/TRIG_IN4/LPSPI1_SDI/LPUART1_TXD/CT_INP5/PWM0_B1/LPUART5_RTS_B/SmartDMA_PIO9, label: PWM_V_L, identifier: PWM_V_L}
- {pin_num: '42', pin_signal: P3_8/WUU0_IN23/TRIG_IN3/LPSPI1_SDO/LPUART1_RXD/CT_INP4/PWM0_A1/LPUART5_CTS_B/SmartDMA_PIO8/CLKOUT, label: PWM_V_H, identifier: PWM_V_H}
- {pin_num: '45', pin_signal: P3_1/TRIG_IN1/LPUART3_TXD/CT_INP17/PWM0_B0/PWM1_X1/SmartDMA_PIO1/FREQME_CLK_OUT0, label: PMW_U_L, identifier: PMW_U_L}
- {pin_num: '46', pin_signal: P3_0/WUU0_IN22/TRIG_IN0/LPUART3_RXD/CT_INP16/PWM0_A0/PWM1_X0/SmartDMA_PIO0, label: PMW_U_H, identifier: PMW_U_H}
- {pin_num: '54', pin_signal: P0_16/WUU0_IN2/LPI2C0_SDA/LPSPI0_PCS2/CT0_MAT0/UTICK_CAP2/SmartDMA_PIO6, label: ZC_IN, identifier: DRUM_UP;ZC_IN}
- {pin_num: '55', pin_signal: P0_17/LPI2C0_SCL/LPSPI0_PCS3/CT0_MAT1/UTICK_CAP3/SmartDMA_PIO7, label: PILOT_GND_REL_HEAT, identifier: GP_OUT_0;PILOT_GND_REL_HEAT}
- {pin_num: '57', pin_signal: P1_1/TRIG_IN1/LPSPI0_SCK/LPI2C1_SCL/CT_INP5/CT0_MAT3/ADC0_A17/CMP1_IN3, label: GP_OUT_5, identifier: GP_OUT_5}
- {pin_num: '27', pin_signal: P2_19/TRIG_OUT5/CT3_MAT3/SmartDMA_PIO21/ADC1_A2/OPAMP1_OUT, label: OPAMP1_OUT_CURR_V, identifier: MP1_OUT_CURR_V;ADC1_A2_CURR_V;OPAMP1_OUT_CURR_V}
- {pin_num: '25', pin_signal: P2_16/LPSPI1_SDI/LPUART1_RTS_B/CT3_MAT0/CT0_MAT2/SmartDMA_PIO19/ADC0_A6/ADC2_A4/OPAMP1_INP, label: OPAMP1_INP_GNDV, identifier: OPAMP1_INP_CURR_V;ADC0_CURR_V;ADC2_CURR_V;ADC0_A6_CURR_V;ADC2_A4_CURR_V;OPAMP1_INP_GNDV}
- {pin_num: '14', pin_signal: P2_0/WUU0_IN18/TRIG_IN6/LPUART0_RXD/LPUART4_CTS_B/CT_INP16/CT2_MAT0/SmartDMA_PIO24/ADC0_A0/OPAMP2_INP, label: OPAMP2_INP_GNDW, identifier: OPAMP2_INP_CURR_W;ADC0_A0_CURR_W;OPAMP2_INP_GNDW;ADC0_A0_GNDW}
- {pin_num: '15', pin_signal: P2_1/TRIG_IN7/LPUART0_TXD/LPUART4_RTS_B/CT_INP17/CT2_MAT1/SmartDMA_PIO25/ADC1_A0/OPAMP2_INN, label: OPAMP2_INN_CURR_W, identifier: OPAMP2_INN_CURR_W;ADC1_CURR_W;ADC1_A0_CURR_W}
- {pin_num: '20', pin_signal: P2_6/TRIG_OUT4/LPSPI1_PCS1/LPUART4_RXD/CT_INP18/CT1_MAT2/SmartDMA_PIO30/ADC1_A3/ADC2_A2/OPAMP2_OUT, label: OPAMP2_OUT_CURR_W, identifier: OPAMP2_OUT_CURR_W;ADC2_A2_CURR_W;ADC1_A3_CURR_W}
- {pin_num: '4', pin_signal: P1_10/LPUART1_RTS_B/LPI2C2_SDAS/CT2_MAT0/SmartDMA_PIO6/LPUART5_TXD/CAN0_TXD/ADC1_A8, label: GP_OUT_1, identifier: GP_OUT_1}
- {pin_num: '5', pin_signal: P1_11/WUU0_IN11/TRIG_OUT2/LPUART1_CTS_B/LPI2C2_SCLS/CT2_MAT1/SmartDMA_PIO7/LPUART5_RXD/CAN0_RXD/ADC1_A9, label: FB_DIVER, identifier: GP_OUT_2;FB_DIVER}
- {pin_num: '2', pin_signal: P1_8/WUU0_IN10/FREQME_CLK_IN0/LPUART1_RXD/LPI2C2_SDA/CT_INP8/CT0_MAT2/SmartDMA_PIO4, label: COMM_MAIN_RX, identifier: COMM_MAIN_RX}
- {pin_num: '3', pin_signal: P1_9/FREQME_CLK_IN1/LPUART1_TXD/LPI2C2_SCL/CT_INP9/CT0_MAT3/SmartDMA_PIO5, label: FB_HEATER, identifier: COMM_MAIN_TX;FB_HEATER}
- {pin_num: '7', pin_signal: P1_13/TRIG_IN3/LPI2C1_SCL/LPUART2_TXD/CT2_MAT3/SmartDMA_PIO9/LPUART5_RTS_B/ADC1_A11, label: ADC1_AC_?LINE, identifier: AC_LINE;ADC1_AC_LINE;ADC1_A11_AC_LINE}
- {pin_num: '8', pin_signal: P1_29/RESET_B/SPC_LPREQ, label: RESET, identifier: RESET}
- {pin_num: '50', pin_signal: P0_1/TCLK/SWCLK/LPUART0_CTS_B/LPSPI0_SDI/CT_INP1, label: TCK_SWCLK, identifier: SWD_SWCLK;TCK_SWCLK}
- {pin_num: '62', pin_signal: P1_4/WUU0_IN8/FREQME_CLK_IN0/LPSPI0_PCS3/LPUART2_RXD/CT1_MAT2/SmartDMA_PIO0/ADC0_A20/CMP0_IN2, label: ADC0_A20_BEMF_W, identifier: ADC0_A20_BEMF_W;CMP0_IN2P_BEMF_W;CMP0_IN2N_BEMF_W}
- {pin_num: '63', pin_signal: P1_5/FREQME_CLK_IN1/LPSPI0_PCS2/LPUART2_TXD/CT1_MAT3/SmartDMA_PIO1/ADC0_A21/CMP1_IN2, label: ADC0_A21_BEMF_V, identifier: ADC0_A21_BEMF_V;CMP0_IN2N_BEMF_V;CMP1_IN2P_BEMF_V;CMP1_IN2N_BEMF_V}
- {pin_num: '64', pin_signal: P1_6/TRIG_IN2/LPSPI0_PCS1/LPUART2_RTS_B/CT_INP6/CT4_MAT0/SmartDMA_PIO2/ADC0_A22, label: ADC0_A22_BEMF_U, identifier: ADC0_A22_BEMF_V;ADC0_A22_BEMF_U}
- {pin_num: '58', pin_signal: P1_2/TRIG_OUT0/LPSPI0_SDI/LPI2C1_SDAS/CT1_MAT0/CT_INP0/CAN0_TXD/ADC0_A18/CMP2_IN3, label: ADC0_A18_VBUS_DC_2, identifier: ADC0_A18_VBUS_DC_2;CMP2_IN3_VBUS_DC_2;CMP2_IN3N_VBUS_DC_2;CMP2_IN3P_VBUS_DC_2}
- {pin_num: '59', pin_signal: P1_3/WUU0_IN7/TRIG_OUT1/LPSPI0_PCS0/LPI2C1_SCLS/CT1_MAT1/CT_INP1/CAN0_RXD/ADC0_A19/CMP0_IN1, label: ADC0_A18_VBUS_DC_1, identifier: ADC0_A18_VBUS_DC_2;ADC0_A18_VBUS_DC_1;CMP0_IN1P_VBUS_DC_1;CMP0_IN1N_VBUS_DC_1}
- {pin_num: '49', pin_signal: P0_0/TMS/SWDIO/LPUART0_RTS_B/LPSPI0_PCS0/CT_INP0, label: TMS_SWDIO, identifier: SWDIO;TMS_SWDIO}
- {pin_num: '51', pin_signal: P0_2/TDO/SWO/LPUART0_RXD/LPSPI0_SCK/CT0_MAT0/UTICK_CAP0/ADC2_A8, label: TDO_SWO, identifier: SWO;TDO_SWO}
- {pin_num: '17', pin_signal: P2_3/WUU0_IN19/TRIG_IN7/LPUART0_CTS_B/LPUART2_RXD/CT_INP13/CT2_MAT3/SmartDMA_PIO27/ADC0_A3/CMP1_IN0/ADC1_A4, label: IN_12V_DS, identifier: PWM0FAULT0_OVER_CURRENT_TRIP_INP;PWM0FAULT0_OVER_CURRENT_TRIP;PWM0FAULT0_OVER_CURRENT_TRIP_INMUX;IN_12VDS;IN_12V_DS}
- {pin_num: '56', pin_signal: P1_0/WUU0_IN6/LPTMR0_ALT3/TRIG_IN0/LPSPI0_SDO/LPI2C1_SDA/CT_INP4/CT0_MAT2/ADC0_A16/CMP0_IN3, label: PILOT_GND_SWITCH_REL, identifier: PWM0FAULT0_OVER_VOLTAGE_TRIP;PWM0FAULT0_OVER_VOLTAGE_TRIP_INMUX;PILOT_GND_SWITCH_REL}
- {pin_num: '30', pin_signal: P3_31/LPTMR0_ALT2/TRIG_IN10/LPI2C3_SDAS/LPUART4_CTS_B/CT0_MAT3/PWM1_B0/SmartDMA_PIO31/ADC1_A20, label: ADC1_IPMTEMP, identifier: ADC1_A20_IPMTEMP;ADC1_A28_IPMTEMP}
- {pin_num: '33', pin_signal: P3_28/WUU0_IN26/TRIG_IN11/LPI2C3_SDA/LPUART4_RXD/CT_INP12/CT3_MAT2/PWM1_B3/SmartDMA_PIO28, label: GEN_UART4_RX, identifier: GEN_UART4_RX}
- {pin_num: '34', pin_signal: P3_27/WUU0_IN30/TRIG_OUT7/LPI2C3_SCL/LPUART4_TXD/CT_INP13/CT3_MAT1/PWM1_A3/SmartDMA_PIO27, label: GEN_UART4_TX, identifier: GEN_UART4_TX}
- {pin_num: '9', pin_signal: P1_30/TRIG_OUT3/LPI2C0_SDA/CT_INP16/XTAL48M, label: OPT_XTAL_IN1, identifier: OPT_XTAL_IN1}
- {pin_num: '10', pin_signal: P1_31/TRIG_IN4/LPI2C0_SCL/CT_INP17/EXTAL48M, label: OPT_XTAL_IN2, identifier: OPT_XTAL_IN2}
- {pin_num: '19', pin_signal: P2_5/LPUART2_RTS_B/CT_INP15/CT1_MAT1/SmartDMA_PIO29/ADC1_A1/ADC3_A0, label: PILOT_FAIL_TST_BULK, identifier: ADC1_A1_MCU_ANALOG_TEST;ADC3_A0_MCU_ANALOG_TEST;PIL_FAIL_TST_BULK;PILOT_FAIL_TST_BULK}
- {pin_num: '21', pin_signal: P2_7/TRIG_IN5/LPUART4_TXD/CT_INP19/CT1_MAT3/SmartDMA_PIO31/VREFI/ADC1_A7/ADC3_A7/ADC0_A7/ADC2_A7, label: ADC_VREF_IN, identifier: ADC0_VREF_IN;ADC2_VREF_IN;ADC3_VREF_IN;ADC1_VREF_IN;CMP0_VREF_IN;CMP1_VREF_IN;ADC2_A7_VREF_IN;ADC3_A7_VREF_IN;ADC0_A7_VREF_IN;ADC1_A7_VREF_IN}
- {pin_num: '22', pin_signal: P2_12/WUU0_IN20/LPSPI1_SCK/LPUART1_RXD/CT4_MAT0/CT0_MAT0/SmartDMA_PIO16/CAN0_RXD/ADC0_A5/ADC2_A5/OPAMP0_INP, label: OPAMP0_INP_GNDU,
  identifier: ADC0_A5_INP_CURR_U;OPAMP0_INP;OPAMP0_INP_CURR_U;ADC2_A5_INP_CURR_U;OPAMP0_INP_GNDU}
- {pin_num: '23', pin_signal: P2_13/TRIG_IN8/LPSPI1_SDO/LPUART1_TXD/CT4_MAT1/CT0_MAT1/SmartDMA_PIO17/CAN0_TXD/ADC1_A5/ADC3_A5/OPAMP0_INN, label: OPAMP0_CURR_U_N,
  identifier: ADC1_A5_CURR_U_EXT;ADC3_A5_CURR_U_EXT;OPAMP0_INN;CURR_U_N;OPAMP0_CURR_U_N}
- {pin_num: '11', pin_signal: VSS/VSSA/VREFL, label: MC_GND}
- {pin_num: '12', pin_signal: VREFH/VDD_ANA, label: 3V3}
- {pin_num: '13', pin_signal: VDD13, label: MC_3V3}
- {pin_num: '35', pin_signal: P3_15/LPUART2_TXD/LPUART3_RTS_B/CT_INP7/PWM0_X3/PWM1_B1/SmartDMA_PIO15/ADC3_A17, label: PILOT_DIVER, identifier: PILOT_DIVER}
- {pin_num: '43', pin_signal: P3_7/TRIG_IN2/LPSPI1_PCS2/LPUART3_CTS_B/CT4_MAT3/PWM0_B3/PWM1_B0/SmartDMA_PIO7/ADC3_A13, label: PILOT_SYN_MOTOR, identifier: PILOT_SYN_MOTOR}
- {pin_num: '52', pin_signal: P0_3/TDI/LPUART0_TXD/LPSPI0_SDO/CT0_MAT1/UTICK_CAP1/CMP0_OUT/CMP1_IN1/ADC0_A14, label: TDI, identifier: TDI}
- {pin_num: '53', pin_signal: P0_6/ISPMODE_N/LPI2C0_HREQ/LPSPI0_PCS1/CT_INP2/SmartDMA_PIO2/CMP1_OUT/CLKOUT/ADC0_A15, label: MEAS_3V3, identifier: MEAS_3V3}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "fsl_inputmux.h"
#include "pin_mux.h"

