ehcouto/DEA801_ARMotion/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', prefix: PIN_, coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '15', peripheral: ADC1, signal: 'A, 0', pin_signal: P2_1/TRIG_IN7/LPUART0_TXD/LPUART4_RTS_B/CT_INP17/CT2_MAT1/SmartDMA_PIO25/ADC1_A0/OPAMP2_INN, identifier: ADC1_A0_CURR_W}
  - {pin_num: '15', peripheral: OPAMP2, signal: 'op_inn, 0', pin_signal: P2_1/TRIG_IN7/LPUART0_TXD/LPUART4_RTS_B/CT_INP17/CT2_MAT1/SmartDMA_PIO25/ADC1_A0/OPAMP2_INN,
    identifier: OPAMP2_INN_CURR_W}
  - {pin_num: '16', peripheral: DAC0, signal: OUT, pin_signal: P2_2/TRIG_IN6/LPUART0_RTS_B/LPUART2_TXD/CT_INP12/CT2_MAT2/SmartDMA_PIO26/ADC0_A4/CMP0_IN0/DAC0_OUT,
    identifier: DAC_OUT}
  - {pin_num: '21', peripheral: ADC0, signal: VREFI, pin_signal: P2_7/TRIG_IN5/LPUART4_TXD/CT_INP19/CT1_MAT3/SmartDMA_PIO31/VREFI/ADC1_A7/ADC3_A7/ADC0_A7/ADC2_A7,
    identifier: ADC0_VREF_IN}
  - {pin_num: '21', peripheral: ADC2, signal: VREFI, pin_signal: P2_7/TRIG_IN5/LPUART4_TXD/CT_INP19/CT1_MAT3/SmartDMA_PIO31/VREFI/ADC1_A7/ADC3_A7/ADC0_A7/ADC2_A7,
    identifier: ADC2_VREF_IN}
  - {pin_num: '21', peripheral: ADC3, signal: VREFI, pin_signal: P2_7/TRIG_IN5/LPUART4_TXD/CT_INP19/CT1_MAT3/SmartDMA_PIO31/VREFI/ADC1_A7/ADC3_A7/ADC0_A7/ADC2_A7,
    identifier: ADC3_VREF_IN}
  - {pin_num: '21', peripheral: ADC1, signal: VREFI, pin_signal: P2_7/TRIG_IN5/LPUART4_TXD/CT_INP19/CT1_MAT3/SmartDMA_PIO31/VREFI/ADC1_A7/ADC3_A7/ADC0_A7/ADC2_A7,
    identifier: ADC1_VREF_IN}
  - {pin_num: '21', peripheral: CMP0, signal: DAC_8bit_VREFH2, pin_signal: P2_7/TRIG_IN5/LPUART4_TXD/CT_INP19/CT1_MAT3/SmartDMA_PIO31/VREFI/ADC1_A7/ADC3_A7/ADC0_A7/ADC2_A7,
    identifier: CMP0_VREF_IN}
  - {pin_num: '21', peripheral: CMP1, signal: DAC_8bit_VREFH2, pin_signal: P2_7/TRIG_IN5/LPUART4_TXD/CT_INP19/CT1_MAT3/SmartDMA_PIO31/VREFI/ADC1_A7/ADC3_A7/ADC0_A7/ADC2_A7,
    identifier: CMP1_VREF_IN}
  - {pin_num: '21', peripheral: ADC2, signal: 'A, 7', pin_signal: P2_7/TRIG_IN5/LPUART4_TXD/CT_INP19/CT1_MAT3/SmartDMA_PIO31/VREFI/ADC1_A7/ADC3_A7/ADC0_A7/ADC2_A7,
    identifier: ADC2_A7_VREF_IN}
  - {pin_num: '21', peripheral: ADC3, signal: 'A, 7', pin_signal: P2_7/TRIG_IN5/LPUART4_TXD/CT_INP19/CT1_MAT3/SmartDMA_PIO31/VREFI/ADC1_A7/ADC3_A7/ADC0_A7/ADC2_A7,
    identifier: ADC3_A7_VREF_IN}
  - {pin_num: '21', peripheral: ADC0, signal: 'A, 7', pin_signal: P2_7/TRIG_IN5/LPUART4_TXD/CT_INP19/CT1_MAT3/SmartDMA_PIO31/VREFI/ADC1_A7/ADC3_A7/ADC0_A7/ADC2_A7,
    identifier: ADC0_A7_VREF_IN}
  - {pin_num: '21', peripheral: ADC1, signal: 'A, 7', pin_signal: P2_7/TRIG_IN5/LPUART4_TXD/CT_INP19/CT1_MAT3/SmartDMA_PIO31/VREFI/ADC1_A7/ADC3_A7/ADC0_A7/ADC2_A7,
    identifier: ADC1_A7_VREF_IN}
  - {pin_num: '23', peripheral: OPAMP0, signal: 'op_inn, 0', pin_signal: P2_13/TRIG_IN8/LPSPI1_SDO/LPUART1_TXD/CT4_MAT1/CT0_MAT1/SmartDMA_PIO17/CAN0_TXD/ADC1_A5/ADC3_A5/OPAMP0_INN,
    identifier: OPAMP0_CURR_U_N}
  - {pin_num: '25', peripheral: OPAMP1, signal: 'op_inp, 0', pin_signal: P2_16/LPSPI1_SDI/LPUART1_RTS_B/CT3_MAT0/CT0_MAT2/SmartDMA_PIO19/ADC0_A6/ADC2_A4/OPAMP1_INP,
    identifier: OPAMP1_INP_GNDV}
  - {pin_num: '30', peripheral: ADC1, signal: 'A, 20', pin_signal: P3_31/LPTMR0_ALT2/TRIG_IN10/LPI2C3_SDAS/LPUART4_CTS_B/CT0_MAT3/PWM1_B0/SmartDMA_PIO31/ADC1_A20,
    identifier: ADC1_A20_IPMTEMP}
  - {pin_num: '30', peripheral: ADC1, signal: 'A, 28', pin_signal: P3_31/LPTMR0_ALT2/TRIG_IN10/LPI2C3_SDAS/LPUART4_CTS_B/CT0_MAT3/PWM1_B0/SmartDMA_PIO31/ADC1_A20,
    identifier: ADC1_A28_IPMTEMP}
  - {pin_num: '31', peripheral: GPIO3, signal: 'GPIO, 30', pin_signal: P3_30/TRIG_OUT6/LPI2C3_SCLS/LPUART4_RTS_B/CT0_MAT2/PWM1_A0/SmartDMA_PIO30/ADC1_A21, identifier: PUMP_SET,
    direction: OUTPUT}
  - {pin_num: '33', peripheral: LPUART4, signal: RX, pin_signal: P3_28/WUU0_IN26/TRIG_IN11/LPI2C3_SDA/LPUART4_RXD/CT_INP12/CT3_MAT2/PWM1_B3/SmartDMA_PIO28}
  - {pin_num: '34', peripheral: LPUART4, signal: TX, pin_signal: P3_27/WUU0_IN30/TRIG_OUT7/LPI2C3_SCL/LPUART4_TXD/CT_INP13/CT3_MAT1/PWM1_A3/SmartDMA_PIO27}
  - {pin_num: '36', peripheral: GPIO3, signal: 'GPIO, 14', pin_signal: P3_14/WUU0_IN25/LPUART2_RXD/LPUART3_CTS_B/CT_INP6/PWM0_X2/PWM1_A1/SmartDMA_PIO14/ADC3_A16,
    identifier: PILOT_EV_H2O, direction: OUTPUT}
  - {pin_num: '37', peripheral: GPIO3, signal: 'GPIO, 13', pin_signal: P3_13/LPUART2_CTS_B/LPUART3_RXD/CT1_MAT3/PWM0_X1/PWM1_B2/SmartDMA_PIO13/ADC3_A15, identifier: PILOT_EV_DISP,
    direction: OUTPUT}
  - {pin_num: '38', peripheral: GPIO3, signal: 'GPIO, 12', pin_signal: P3_12/LPUART2_RTS_B/LPUART3_TXD/CT1_MAT2/PWM0_X0/PWM1_A2/SmartDMA_PIO12/ADC3_A14, identifier: PILOT_EV_REGEN,
    direction: OUTPUT}
  - {pin_num: '41', peripheral: FlexPWM0, signal: 'B, 1', pin_signal: P3_9/TRIG_IN4/LPSPI1_SDI/LPUART1_TXD/CT_INP5/PWM0_B1/LPUART5_RTS_B/SmartDMA_PIO9, direction: OUTPUT}
  - {pin_num: '42', peripheral: FlexPWM0, signal: 'A, 1', pin_signal: P3_8/WUU0_IN23/TRIG_IN3/LPSPI1_SDO/LPUART1_RXD/CT_INP4/PWM0_A1/LPUART5_CTS_B/SmartDMA_PIO8/CLKOUT,
    direction: OUTPUT}
  - {pin_num: '45', peripheral: FlexPWM0, signal: 'B, 0', pin_signal: P3_1/TRIG_IN1/LPUART3_TXD/CT_INP17/PWM0_B0/PWM1_X1/SmartDMA_PIO1/FREQME_CLK_OUT0, direction: OUTPUT}
  - {pin_num: '46', peripheral: FlexPWM0, signal: 'A, 0', pin_signal: P3_0/WUU0_IN22/TRIG_IN0/LPUART3_RXD/CT_INP16/PWM0_A0/PWM1_X0/SmartDMA_PIO0, direction: OUTPUT}
  - {pin_num: '50', peripheral: SWD, signal: SWCLK, pin_signal: P0_1/TCLK/SWCLK/LPUART0_CTS_B/LPSPI0_SDI/CT_INP1, identifier: TCK_SWCLK}
  - {pin_num: '58', peripheral: ADC0, signal: 'A, 18', pin_signal: P1_2/TRIG_OUT0/LPSPI0_SDI/LPI2C1_SDAS/CT1_MAT0/CT_INP0/CAN0_TXD/ADC0_A18/CMP2_IN3, identifier: ADC0_A18_VBUS_DC_2}
  - {pin_num: '58', peripheral: CMP2, signal: 'IN, 3N', pin_signal: P1_2/TRIG_OUT0/LPSPI0_SDI/LPI2C1_SDAS/CT1_MAT0/CT_INP0/CAN0_TXD/ADC0_A18/CMP2_IN3, identifier: CMP2_IN3N_VBUS_DC_2}
  - {pin_num: '58', peripheral: CMP2, signal: 'IN, 3P', pin_signal: P1_2/TRIG_OUT0/LPSPI0_SDI/LPI2C1_SDAS/CT1_MAT0/CT_INP0/CAN0_TXD/ADC0_A18/CMP2_IN3, identifier: CMP2_IN3P_VBUS_DC_2}
  - {pin_num: '59', peripheral: ADC0, signal: 'A, 19', pin_signal: P1_3/WUU0_IN7/TRIG_OUT1/LPSPI0_PCS0/LPI2C1_SCLS/CT1_MAT1/CT_INP1/CAN0_RXD/ADC0_A19/CMP0_IN1, identifier: ADC0_A18_VBUS_DC_1}
  - {pin_num: '59', peripheral: CMP0, signal: 'IN, 1P', pin_signal: P1_3/WUU0_IN7/TRIG_OUT1/LPSPI0_PCS0/LPI2C1_SCLS/CT1_MAT1/CT_INP1/CAN0_RXD/ADC0_A19/CMP0_IN1, identifier: CMP0_IN1P_VBUS_DC_1}
  - {pin_num: '59', peripheral: CMP0, signal: 'IN, 1N', pin_signal: P1_3/WUU0_IN7/TRIG_OUT1/LPSPI0_PCS0/LPI2C1_SCLS/CT1_MAT1/CT_INP1/CAN0_RXD/ADC0_A19/CMP0_IN1, identifier: CMP0_IN1N_VBUS_DC_1}
  - {pin_num: '49', peripheral: SWD, signal: SWDIO, pin_signal: P0_0/TMS/SWDIO/LPUART0_RTS_B/LPSPI0_PCS0/CT_INP0, identifier: TMS_SWDIO}
  - {pin_num: '51', peripheral: SWD, signal: SWO, pin_signal: P0_2/TDO/SWO/LPUART0_RXD/LPSPI0_SCK/CT0_MAT0/UTICK_CAP0/ADC2_A8, identifier: TDO_SWO}
  - {pin_num: '10', peripheral: SCG0, signal: EXTAL, pin_signal: P1_31/TRIG_IN4/LPI2C0_SCL/CT_INP17/EXTAL48M}
  - {pin_num: '17', peripheral: GPIO2, signal: 'GPIO, 3', pin_signal: P2_3/WUU0_IN19/TRIG_IN7/LPUART0_CTS_B/LPUART2_RXD/CT_INP13/CT2_MAT3/SmartDMA_PIO27/ADC0_A3/CMP1_IN0/ADC1_A4,
    identifier: IN_12V_DS, direction: INPUT}
  - {pin_num: '56', peripheral: GPIO1, signal: 'GPIO, 0', pin_signal: P1_0/WUU0_IN6/LPTMR0_ALT3/TRIG_IN0/LPSPI0_SDO/LPI2C1_SDA/CT_INP4/CT0_MAT2/ADC0_A16/CMP0_IN3,
    identifier: PILOT_GND_SWITCH_REL, direction: OUTPUT}
  - {pin_num: '39', peripheral: FlexPWM0, signal: 'B, 2', pin_signal: P3_11/WUU0_IN24/TRIG_IN6/LPSPI1_PCS0/LPUART1_CTS_B/CT1_MAT1/PWM0_B2/LPUART5_RXD/SmartDMA_PIO11,
    direction: OUTPUT}
  - {pin_num: '40', peripheral: FlexPWM0, signal: 'A, 2', pin_signal: P3_10/TRIG_IN5/LPSPI1_SCK/LPUART1_RTS_B/CT1_MAT0/PWM0_A2/LPUART5_TXD/SmartDMA_PIO10, direction: OUTPUT}
  - {pin_num: '22', peripheral: OPAMP0, signal: 'op_inp, 0', pin_signal: P2_12/WUU0_IN20/LPSPI1_SCK/LPUART1_RXD/CT4_MAT0/CT0_MAT0/SmartDMA_PIO16/CAN0_RXD/ADC0_A5/ADC2_A5/OPAMP0_INP,
    identifier: OPAMP0_INP_GNDU}
  - {pin_num: '54', peripheral: GPIO0, signal: 'GPIO, 16', pin_signal: P0_16/WUU0_IN2/LPI2C0_SDA/LPSPI0_PCS2/CT0_MAT0/UTICK_CAP2/SmartDMA_PIO6, identifier: ZC_IN,
    direction: INPUT}
  - {pin_num: '55', peripheral: GPIO0, signal: 'GPIO, 17', pin_signal: P0_17/LPI2C0_SCL/LPSPI0_PCS3/CT0_MAT1/UTICK_CAP3/SmartDMA_PIO7, identifier: PILOT_GND_REL_HEAT,
    direction: OUTPUT}
  - {pin_num: '27', peripheral: OPAMP1, signal: OUT, pin_signal: P2_19/TRIG_OUT5/CT3_MAT3/SmartDMA_PIO21/ADC1_A2/OPAMP1_OUT, identifier: OPAMP1_OUT_CURR_V}
  - {pin_num: '24', peripheral: OPAMP0, signal: OUT, pin_signal: P2_15/WUU0_IN21/TRIG_OUT4/LPSPI1_SDI/LPUART1_RTS_B/CT4_MAT3/CT0_MAT2/SmartDMA_PIO18/OPAMP0_OUT/ADC0_A2,
    identifier: OPAMP0_OUT_CURR_U}
  - {pin_num: '26', peripheral: OPAMP1, signal: 'op_inn, 0', pin_signal: P2_17/TRIG_IN9/LPSPI1_PCS0/LPUART1_CTS_B/CT3_MAT1/CT0_MAT3/SmartDMA_PIO20/ADC1_A6/ADC3_A4/OPAMP1_INN,
    identifier: OPAMP1_INN_CURR_V}
  - {pin_num: '14', peripheral: OPAMP2, signal: 'op_inp, 0', pin_signal: P2_0/WUU0_IN18/TRIG_IN6/LPUART0_RXD/LPUART4_CTS_B/CT_INP16/CT2_MAT0/SmartDMA_PIO24/ADC0_A0/OPAMP2_INP,
    identifier: OPAMP2_INP_GNDW}
  - {pin_num: '14', peripheral: ADC0, signal: 'A, 0', pin_signal: P2_0/WUU0_IN18/TRIG_IN6/LPUART0_RXD/LPUART4_CTS_B/CT_INP16/CT2_MAT0/SmartDMA_PIO24/ADC0_A0/OPAMP2_INP,
    identifier: ADC0_A0_GNDW}
  - {pin_num: '20', peripheral: OPAMP2, signal: OUT, pin_signal: P2_6/TRIG_OUT4/LPSPI1_PCS1/LPUART4_RXD/CT_INP18/CT1_MAT2/SmartDMA_PIO30/ADC1_A3/ADC2_A2/OPAMP2_OUT,
    identifier: OPAMP2_OUT_CURR_W}
  - {pin_num: '20', peripheral: ADC2, signal: 'A, 2', pin_signal: P2_6/TRIG_OUT4/LPSPI1_PCS1/LPUART4_RXD/CT_INP18/CT1_MAT2/SmartDMA_PIO30/ADC1_A3/ADC2_A2/OPAMP2_OUT,
    identifier: ADC2_A2_CURR_W}
  - {pin_num: '20', peripheral: ADC1, signal: 'A, 3', pin_signal: P2_6/TRIG_OUT4/LPSPI1_PCS1/LPUART4_RXD/CT_INP18/CT1_MAT2/SmartDMA_PIO30/ADC1_A3/ADC2_A2/OPAMP2_OUT,
    identifier: ADC1_A3_CURR_W}
  - {pin_num: '9', peripheral: SCG0, signal: XTAL, pin_signal: P1_30/TRIG_OUT3/LPI2C0_SDA/CT_INP16/XTAL48M}
  - {pin_num: '19', peripheral: GPIO2, signal: 'GPIO, 5', pin_signal: P2_5/LPUART2_RTS_B/CT_INP15/CT1_MAT1/SmartDMA_PIO29/ADC1_A1/ADC3_A0, identifier: PILOT_FAIL_TST_BULK,
    direction: OUTPUT}
  - {pin_num: '5', peripheral: GPIO1, signal: 'GPIO, 11', pin_signal: P1_11/WUU0_IN11/TRIG_OUT2/LPUART1_CTS_B/LPI2C2_SCLS/CT2_MAT1/SmartDMA_PIO7/LPUART5_RXD/CAN0_RXD/ADC1_A9,
    identifier: FB_DIVER, direction: OUTPUT}
  - {pin_num: '8', peripheral: SYSCON, signal: RESET, pin_signal: P1_29/RESET_B/SPC_LPREQ}
  - {peripheral: CMP0, signal: 'IN, 4N', pin_signal: OPAMP3_OUT}
  - {peripheral: CMP0, signal: 'IN, 4P', pin_signal: OPAMP0_OUT}
  - {peripheral: CMP0, signal: 'IN, 7N', pin_signal: CMP0_DAC}
  - {peripheral: CMP0, signal: 'IN, 7P', pin_signal: CMP0_DAC}
  - {peripheral: CMP1, signal: 'IN, 4P', pin_signal: OPAMP1_OUT}
  - {peripheral: CMP1, signal: 'IN, 4N', pin_signal: DAC0_OUT}
  - {peripheral: CMP1, signal: 'IN, 7N', pin_signal: CMP1_DAC}
  - {peripheral: CMP1, signal: 'IN, 7P', pin_signal: CMP1_DAC}
  - {peripheral: CMP2, signal: 'IN, 4N', pin_signal: DAC0_OUT}
  - {peripheral: CMP2, signal: 'IN, 4P', pin_signal: OPAMP2_OUT}
  - {peripheral: CMP2, signal: 'IN, 7N', pin_signal: CMP2_DAC}
  - {peripheral: CMP2, signal: 'IN, 7P', pin_signal: CMP2_DAC}
  - {pin_num: '13', peripheral: SUPPLY, signal: VDD, pin_signal: VDD13}
  - {pin_num: '13', peripheral: CMP1, signal: DAC_8bit_VREFH1, pin_signal: VDD13}
  - {pin_num: '13', peripheral: CMP0, signal: DAC_8bit_VREFH1, pin_signal: VDD13}
  - {pin_num: '11', peripheral: SUPPLY, signal: VREFL, pin_signal: VSS/VSSA/VREFL}
  - {pin_num: '11', peripheral: SUPPLY, signal: VSS, pin_signal: VSS/VSSA/VREFL}
  - {pin_num: '11', peripheral: ADC3, signal: VREFL, pin_signal: VSS/VSSA/VREFL}
  - {pin_num: '11', peripheral: ADC3, signal: 'A, 24', pin_signal: VSS/VSSA/VREFL}
  - {pin_num: '11', peripheral: ADC2, signal: VREFL, pin_signal: VSS/VSSA/VREFL}
  - {pin_num: '11', peripheral: ADC2, signal: 'A, 24', pin_signal: VSS/VSSA/VREFL}
  - {pin_num: '11', peripheral: ADC1, signal: VREFL, pin_signal: VSS/VSSA/VREFL}
  - {pin_num: '11', peripheral: ADC1, signal: 'A, 24', pin_signal: VSS/VSSA/VREFL}
  - {pin_num: '11', peripheral: ADC0, signal: VREFL, pin_signal: VSS/VSSA/VREFL}
  - {pin_num: '11', peripheral: ADC0, signal: 'A, 24', pin_signal: VSS/VSSA/VREFL}
  - {pin_num: '12', peripheral: SUPPLY, signal: VREFH, pin_signal: VREFH/VDD_ANA}
  - {pin_num: '12', peripheral: SUPPLY, signal: VDD_ANA, pin_signal: VREFH/VDD_ANA}
  - {pin_num: '12', peripheral: ADC3, signal: VREFH, pin_signal: VREFH/VDD_ANA}
  - {pin_num: '12', peripheral: ADC3, signal: VDDA, pin_signal: VREFH/VDD_ANA}
  - {pin_num: '12', peripheral: DAC0, signal: VDDA, pin_signal: VREFH/VDD_ANA}
  - {pin_num: '12', peripheral: ADC2, signal: VREFH, pin_signal: VREFH/VDD_ANA}
  - {pin_num: '12', peripheral: ADC2, signal: VDDA, pin_signal: VREFH/VDD_ANA}
  - {pin_num: '12', peripheral: ADC1, signal: VREFH, pin_signal: VREFH/VDD_ANA}
  - {pin_num: '12', peripheral: ADC1, signal: VDDA, pin_signal: VREFH/VDD_ANA}
  - {pin_num: '12', peripheral: ADC0, signal: VREFH, pin_signal: VREFH/VDD_ANA}
  - {pin_num: '12', peripheral: ADC0, signal: VDDA, pin_signal: VREFH/VDD_ANA}
  - {pin_num: '48', peripheral: CMP0, signal: DAC_8bit_VREFH1, pin_signal: VDD48}
  - {pin_num: '48', peripheral: CMP1, signal: DAC_8bit_VREFH1, pin_signal: VDD48}
  - {pin_num: '48', peripheral: SUPPLY, signal: VDD, pin_signal: VDD48}
  - {pin_num: '47', peripheral: SUPPLY, signal: VSS, pin_signal: VSS47}
  - {pin_num: '28', peripheral: SUPPLY, signal: VSS, pin_signal: VSS28}
  - {pin_num: '29', peripheral: SUPPLY, signal: VDD, pin_signal: VDD29}
  - {pin_num: '29', peripheral: CMP1, signal: DAC_8bit_VREFH1, pin_signal: VDD29}
  - {pin_num: '29', peripheral: CMP0, signal: DAC_8bit_VREFH1, pin_signal: VDD29}
  - {pin_num: '61', peripheral: SUPPLY, signal: VSS, pin_signal: VSS61}
  - {pin_num: '60', peripheral: SUPPLY, signal: VDD, pin_signal: VDD60}
  - {pin_num: '60', peripheral: CMP1, signal: DAC_8bit_VREFH1, pin_signal: VDD60}
  - {pin_num: '60', peripheral: CMP0, signal: DAC_8bit_VREFH1, pin_signal: VDD60}
  - {pin_num: '3', peripheral: GPIO1, signal: 'GPIO, 9', pin_signal: P1_9/FREQME_CLK_IN1/LPUART1_TXD/LPI2C2_SCL/CT_INP9/CT0_MAT3/SmartDMA_PIO5, identifier: FB_HEATER,
    direction: INPUT}
  - {pin_num: '16', peripheral: CMP0, signal: 'IN, 0N', pin_signal: P2_2/TRIG_IN6/LPUART0_RTS_B/LPUART2_TXD/CT_INP12/CT2_MAT2/SmartDMA_PIO26/ADC0_A4/CMP0_IN0/DAC0_OUT,
    identifier: DAC_OUT_CMP0N}
  - {pin_num: '16', peripheral: CMP0, signal: 'IN, 0P', pin_signal: P2_2/TRIG_IN6/LPUART0_RTS_B/LPUART2_TXD/CT_INP12/CT2_MAT2/SmartDMA_PIO26/ADC0_A4/CMP0_IN0/DAC0_OUT,
    identifier: DAC_OUT_CMP0P}
  - {pin_num: '16', peripheral: ADC0, signal: 'A, 4', pin_signal: P2_2/TRIG_IN6/LPUART0_RTS_B/LPUART2_TXD/CT_INP12/CT2_MAT2/SmartDMA_PIO26/ADC0_A4/CMP0_IN0/DAC0_OUT,
    identifier: DAC_OUT_ADC0A4}
  - {pin_num: '35', peripheral: GPIO3, signal: 'GPIO, 15', pin_signal: P3_15/LPUART2_TXD/LPUART3_RTS_B/CT_INP7/PWM0_X3/PWM1_B1/SmartDMA_PIO15/ADC3_A17, direction: OUTPUT}
  - {pin_num: '43', peripheral: GPIO3, signal: 'GPIO, 7', pin_signal: P3_7/TRIG_IN2/LPSPI1_PCS2/LPUART3_CTS_B/CT4_MAT3/PWM0_B3/PWM1_B0/SmartDMA_PIO7/ADC3_A13, direction: OUTPUT}
  - {pin_num: '52', peripheral: JTAG, signal: TDI, pin_signal: P0_3/TDI/LPUART0_TXD/LPSPI0_SDO/CT0_MAT1/UTICK_CAP1/CMP0_OUT/CMP1_IN1/ADC0_A14}
  - {pin_num: '53', peripheral: ADC0, signal: 'A, 15', pin_signal: P0_6/ISPMODE_N/LPI2C0_HREQ/LPSPI0_PCS1/CT_INP2/SmartDMA_PIO2/CMP1_OUT/CLKOUT/ADC0_A15}
  - {peripheral: FlexPWM0, signal: 'PWM_FAULT_TRG_CH, 0', pin_signal: cmp0_out}
  - {peripheral: FlexPWM0, signal: 'PWM_FAULT_TRG_CH, 1', pin_signal: cmp1_out}
  - {peripheral: FlexPWM0, signal: 'PWM_FAULT_TRG_CH, 2', pin_signal: cmp2_out}
  - {peripheral: ADC0, signal: 'TRG_CH, 0', pin_signal: pwm0_sm0_mux_trig0}
  - {peripheral: ADC1, signal: 'TRG_CH, 0', pin_signal: pwm0_sm0_mux_trig0}
  - {peripheral: ADC2, signal: 'TRG_CH, 0', pin_signal: pwm0_sm0_mux_trig0}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

