ehcouto/DEA801_ARMotion/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* GPIO0: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateGPIO0);
    /* GPIO1: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateGPIO1);
    /* GPIO2: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateGPIO2);
    /* GPIO3: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateGPIO3);
    /* INPUTMUX0: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateINPUTMUX0);
    /* PORT0: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT0);
    /* PORT1: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT1);
    /* PORT2: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT2);
    /* PORT3: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT3);
    /* GPIO0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kGPIO0_RST_SHIFT_RSTn);
    /* GPIO1 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kGPIO1_RST_SHIFT_RSTn);
    /* GPIO2 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kGPIO2_RST_SHIFT_RSTn);
    /* GPIO3 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kGPIO3_RST_SHIFT_RSTn);
    /* INPUTMUX0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kINPUTMUX0_RST_SHIFT_RSTn);
    /* PORT0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT0_RST_SHIFT_RSTn);
    /* ADC0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kADC0_RST_SHIFT_RSTn);
    /* PORT1 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT1_RST_SHIFT_RSTn);
    /* CMP2 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kCMP2_RST_SHIFT_RSTn);
    /* PORT2 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT2_RST_SHIFT_RSTn);
    /* ADC1 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kADC1_RST_SHIFT_RSTn);
    /* OPAMP0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kOPAMP0_RST_SHIFT_RSTn);
    /* DAC0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kDAC0_RST_SHIFT_RSTn);
    /* ADC2 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kADC2_RST_SHIFT_RSTn);
    /* ADC3 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kADC3_RST_SHIFT_RSTn);
    /* CMP1 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kCMP1_RST_SHIFT_RSTn);
    /* FLEXPWM0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kFLEXPWM0_RST_SHIFT_RSTn);
    /* PORT3 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT3_RST_SHIFT_RSTn);
    /* LPUART4 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kLPUART4_RST_SHIFT_RSTn);

    gpio_pin_config_t ZC_IN_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_16 (pin 54)  */
    GPIO_PinInit(PIN_ZC_IN_GPIO, PIN_ZC_IN_PIN, &ZC_IN_config);

    gpio_pin_config_t PILOT_GND_REL_HEAT_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_17 (pin 55)  */
    GPIO_PinInit(PIN_PILOT_GND_REL_HEAT_GPIO, PIN_PILOT_GND_REL_HEAT_PIN, &PILOT_GND_REL_HEAT_config);

    gpio_pin_config_t PILOT_GND_SWITCH_REL_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_0 (pin 56)  */
    GPIO_PinInit(PIN_PILOT_GND_SWITCH_REL_GPIO, PIN_PILOT_GND_SWITCH_REL_PIN, &PILOT_GND_SWITCH_REL_config);

    gpio_pin_config_t FB_HEATER_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_9 (pin 3)  */
    GPIO_PinInit(PIN_FB_HEATER_GPIO, PIN_FB_HEATER_PIN, &FB_HEATER_config);

    gpio_pin_config_t FB_DIVER_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_11 (pin 5)  */
    GPIO_PinInit(PIN_FB_DIVER_GPIO, PIN_FB_DIVER_PIN, &FB_DIVER_config);

    gpio_pin_config_t IN_12V_DS_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_3 (pin 17)  */
    GPIO_PinInit(PIN_IN_12V_DS_GPIO, PIN_IN_12V_DS_PIN, &IN_12V_DS_config);

    gpio_pin_config_t PILOT_FAIL_TST_BULK_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_5 (pin 19)  */
    GPIO_PinInit(PIN_PILOT_FAIL_TST_BULK_GPIO, PIN_PILOT_FAIL_TST_BULK_PIN, &PILOT_FAIL_TST_BULK_config);
/*
    gpio_pin_config_t PILOT_SYN_MOTOR_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };

    GPIO_PinInit(PIN_PILOT_SYN_MOTOR_GPIO, PIN_PILOT_SYN_MOTOR_PIN, &PILOT_SYN_MOTOR_config);
*/

/*
    gpio_pin_config_t PILOT_SYN_MOTOR_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };

    GPIO_PinInit(PIN_PILOT_SYN_MOTOR_GPIO, PIN_PILOT_SYN_MOTOR_PIN, &PILOT_SYN_MOTOR_config);
*/
    gpio_pin_config_t PILOT_EV_REGEN_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_12 (pin 38)  */
    GPIO_PinInit(PIN_PILOT_EV_REGEN_GPIO, PIN_PILOT_EV_REGEN_PIN, &PILOT_EV_REGEN_config);

    gpio_pin_config_t PILOT_EV_DISP_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_13 (pin 37)  */
    GPIO_PinInit(PIN_PILOT_EV_DISP_GPIO, PIN_PILOT_EV_DISP_PIN, &PILOT_EV_DISP_config);

    gpio_pin_config_t PILOT_EV_H2O_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_14 (pin 36)  */
    GPIO_PinInit(PIN_PILOT_EV_H2O_GPIO, PIN_PILOT_EV_H2O_PIN, &PILOT_EV_H2O_config);

    gpio_pin_config_t PILOT_DIVER_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_15 (pin 35)  */
    GPIO_PinInit(PIN_PILOT_DIVER_GPIO, PIN_PILOT_DIVER_PIN, &PILOT_DIVER_config);

