ehcouto/DEA801_ARMotion/board/pin_mux.c
    /* PORT3_14 (pin 36) is configured as P3_14 */
    PORT_SetPinMux(PIN_PILOT_EV_H2O_PORT, PIN_PILOT_EV_H2O_PIN, kPORT_MuxAlt0);

    PORT3->PCR[14] = ((PORT3->PCR[14] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_15 (pin 35) is configured as P3_15 */
    PORT_SetPinMux(PIN_PILOT_DIVER_PORT, PIN_PILOT_DIVER_PIN, kPORT_MuxAlt0);

    PORT3->PCR[15] = ((PORT3->PCR[15] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_27 (pin 34) is configured as LPUART4_TXD */
    PORT_SetPinMux(PIN_GEN_UART4_TX_PORT, PIN_GEN_UART4_TX_PIN, kPORT_MuxAlt3);

    PORT3->PCR[27] = ((PORT3->PCR[27] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_28 (pin 33) is configured as LPUART4_RXD */
    PORT_SetPinMux(PIN_GEN_UART4_RX_PORT, PIN_GEN_UART4_RX_PIN, kPORT_MuxAlt3);

    PORT3->PCR[28] = ((PORT3->PCR[28] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_30 (pin 31) is configured as P3_30 */
    PORT_SetPinMux(PIN_PUMP_SET_PORT, PIN_PUMP_SET_PIN, kPORT_MuxAlt0);

    PORT3->PCR[30] = ((PORT3->PCR[30] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_31 (pin 30) is configured as ADC1_A20 */
    PORT_SetPinMux(PIN_ADC1_A20_IPMTEMP_PORT, PIN_ADC1_A20_IPMTEMP_PIN, kPORT_MuxAlt0);

    PORT3->PCR[31] = ((PORT3->PCR[31] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Disables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe0));

    /* PORT3_7 (pin 43) is configured as P3_7 */

    PORT_SetPinMux(PIN_PILOT_SYN_MOTOR_PORT, PIN_PILOT_SYN_MOTOR_PIN, kPORT_MuxAlt0);

    PORT3->PCR[7] = ((PORT3->PCR[7] &

                      (~(PORT_PCR_IBE_MASK)))


                     | PORT_PCR_IBE(PCR_IBE_ibe1));


    /* PORT3_8 (pin 42) is configured as PWM0_A1 */
    PORT_SetPinMux(PIN_PWM_V_H_PORT, PIN_PWM_V_H_PIN, kPORT_MuxAlt5);

    PORT3->PCR[8] = ((PORT3->PCR[8] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_9 (pin 41) is configured as PWM0_B1 */
    PORT_SetPinMux(PIN_PWM_V_L_PORT, PIN_PWM_V_L_PIN, kPORT_MuxAlt5);

    PORT3->PCR[9] = ((PORT3->PCR[9] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
